IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
#include "camera_sd_storage.h"

#include "bsp_sccb.h"
#include "camera_dcmi_dma.h"
#include "camera_snapshot_control.h"
#include "ff.h"
#include "diskio.h"
#include "stm32f4xx_hal.h"

#include <stddef.h>
#include <string.h>

#define CAMERA_SD_DVP_PAD_OUTPUT_ENABLE02_REG 0x3018U
#define CAMERA_SD_DVP_CONFLICT_PAD_KEEP_MASK  0x8FU
#define CAMERA_SD_REG_VALUE_UNKNOWN           0xFFFFFFFFU
#define CAMERA_SD_FATFS_CARD_TIMEOUT_MS       1000U
#define CAMERA_SD_FATFS_READ_TIMEOUT_MS       1000U
#define CAMERA_SD_FATFS_WRITE_TIMEOUT_MS      1000U
#define CAMERA_SD_FATFS_MOUNT_NOT_RUN         0xFFFFFFFFU
#define CAMERA_SD_RESTORE_LCD_WIDTH            480U
#define CAMERA_SD_RESTORE_LCD_HEIGHT           320U
#define CAMERA_SD_CAMERA_RESTORE_DELAY_MS       100U
#define CAMERA_SD_SNAPSHOT_FILE_NAME           "SDTEST.TXT"

#define CAMERA_SD_CONFLICT_PIN_MASK \
    (GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_11)
#define CAMERA_SD_CONFLICT_MODE_MASK \
    ((3UL << (8U * 2U)) | (3UL << (9U * 2U)) | (3UL << (11U * 2U)))
#define CAMERA_SD_CONFLICT_AF_MODE \
    ((2UL << (8U * 2U)) | (2UL << (9U * 2U)) | (2UL << (11U * 2U)))
#define CAMERA_SD_CONFLICT_SPEED_HIGH \
    ((2UL << (8U * 2U)) | (2UL << (9U * 2U)) | (2UL << (11U * 2U)))
#define CAMERA_SD_CONFLICT_SPEED_VERY_HIGH CAMERA_SD_CONFLICT_MODE_MASK
#define CAMERA_SD_CONFLICT_PULLUP \
    ((1UL << (8U * 2U)) | (1UL << (9U * 2U)) | (1UL << (11U * 2U)))
#define CAMERA_SD_CONFLICT_AFRH_MASK \
    ((0xFUL << 0U) | (0xFUL << 4U) | (0xFUL << 12U))
#define CAMERA_SD_CONFLICT_AFRH_AF12 \
    ((12UL << 0U) | (12UL << 4U) | (12UL << 12U))
#define CAMERA_SD_CONFLICT_AFRH_AF13 \
    ((13UL << 0U) | (13UL << 4U) | (13UL << 12U))

#define CAMERA_SD_FULL_GPIOC_PIN_MASK \
    (GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12)
#define CAMERA_SD_FULL_GPIOC_MODE_MASK \
    ((3UL << (8U * 2U)) | (3UL << (9U * 2U)) | \
     (3UL << (10U * 2U)) | (3UL << (11U * 2U)) | \
     (3UL << (12U * 2U)))
#define CAMERA_SD_FULL_GPIOD_PIN_MASK  GPIO_PIN_2
#define CAMERA_SD_FULL_GPIOD_MODE_MASK (3UL << (2U * 2U))

typedef struct
{
    GPIO_TypeDef *port;
    uint32_t pin_number;
} CameraSdLine_t;

static const CameraSdLine_t s_camera_sd_lines[] =
{
    {GPIOC, 8U},
    {GPIOC, 9U},
    {GPIOC, 10U},
    {GPIOC, 11U},
    {GPIOC, 12U},
    {GPIOD, 2U}
};

static const char s_camera_sd_snapshot_text[] =
    "ISP_OV5640 SD SNAPSHOT TEST\r\n"
    "stage=13B\r\n"
    "mode=text\r\n"
    "frame=160x120\r\n"
    "format=not_image_yet\r\n"
    "result=PASS\r\n";

static CameraSdStorageStatus_t s_camera_sd_status;
static SD_HandleTypeDef s_camera_sd_handle;
static HAL_SD_CardInfoTypeDef s_camera_sd_card_info;
static FATFS s_camera_sd_fatfs;
static FIL s_camera_sd_file;
static uint32_t s_camera_sd_full_gpio_af12_selected;
static uint32_t s_camera_sd_clock_enabled;
static uint32_t s_camera_sd_hal_init_attempted;
static uint32_t s_camera_sd_card_info_valid;
static uint32_t s_camera_sd_fatfs_session_active;
static uint32_t s_camera_sd_fatfs_write_allowed;
static uint32_t s_camera_sd_fatfs_disk_error;

static void Camera_SDStorage_SetLastError(uint32_t error_code)
{
    s_camera_sd_status.last_error_code = error_code;
    s_camera_sd_status.last_error_text =
        Camera_SDStorage_ErrorToString(error_code);
}

static void Camera_SDStorage_SetSaveError(uint32_t error_code)
{
    s_camera_sd_status.save_error_code = error_code;
    s_camera_sd_status.save_error_text =
        Camera_SDStorage_ErrorToString(error_code);
}

static void Camera_SDStorage_SetMountResult(FRESULT mount_result)
{
    s_camera_sd_status.last_mount_result = (uint32_t)mount_result;
    s_camera_sd_status.last_mount_text =
        (mount_result == FR_OK) ? "PASS" : "FAIL";
}

static void Camera_SDStorage_RecordFirstError(
    uint32_t *first_error,
    uint32_t candidate)
{
    if ((first_error != NULL) &&
        (*first_error == CAMERA_SD_OK) &&
        (candidate != CAMERA_SD_OK))
    {
        *first_error = candidate;
    }
}

static void Camera_SDStorage_EnsureDcmiDmaHandle(void)
{
    if (g_camera_dcmi.DMA_Handle == NULL)
    {
        __HAL_LINKDMA(&g_camera_dcmi, DMA_Handle, g_camera_dma);
    }
}

static uint32_t Camera_SDStorage_WaitForCardTransfer(void)
{
    uint32_t start_tick = HAL_GetTick();
    HAL_SD_CardStateTypeDef card_state;

    for (;;)
    {
        card_state = HAL_SD_GetCardState(&s_camera_sd_handle);
        if (card_state == HAL_SD_CARD_TRANSFER)
        {
            return CAMERA_SD_OK;
        }
        if ((card_state == HAL_SD_CARD_ERROR) ||
            (card_state == HAL_SD_CARD_DISCONNECTED))
        {
            return CAMERA_SD_ERR_FATFS_DISK_NOT_READY;
        }
        if ((HAL_GetTick() - start_tick) >=
            CAMERA_SD_FATFS_CARD_TIMEOUT_MS)
        {
            return CAMERA_SD_ERR_FATFS_CARD_TIMEOUT;
        }

        HAL_Delay(1U);
    }
}

static uint32_t Camera_SDStorage_GetPinMode(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->MODER >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinPull(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->PUPDR >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinSpeed(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->OSPEEDR >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinAf(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    if (pin_number < 8U)
    {
        return (port->AFR[0] >> (pin_number * 4U)) & 0xFU;
    }

    return (port->AFR[1] >> ((pin_number - 8U) * 4U)) & 0xFU;
}

static uint32_t Camera_SDStorage_VerifyFullGpioAf12(void)
{
    uint32_t index;

    for (index = 0U;
         index < (sizeof(s_camera_sd_lines) / sizeof(s_camera_sd_lines[0]));
         ++index)
    {
        const CameraSdLine_t *line = &s_camera_sd_lines[index];

        if ((Camera_SDStorage_GetPinMode(line->port, line->pin_number) != 2U) ||
            (Camera_SDStorage_GetPinPull(line->port, line->pin_number) !=
             GPIO_PULLUP) ||
            (Camera_SDStorage_GetPinSpeed(line->port, line->pin_number) !=
             GPIO_SPEED_FREQ_HIGH) ||
            (Camera_SDStorage_GetPinAf(line->port, line->pin_number) != 12U) ||
            (((line->port->OTYPER >> line->pin_number) & 0x1U) != 0U))
        {
            return 0U;
        }
    }

