IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    s_camera_sd_card_info_valid = 0U;

    if (s_camera_sd_full_gpio_af12_selected == 0U)
    {
        result = CAMERA_SD_ERR_NEED_TAKEOVER;
    }
    else
    {
        Camera_SDStorage_PrepareSdHandle();
        Camera_SDStorage_EnableSdioClock();
        s_camera_sd_hal_init_attempted = 1U;
        hal_status = HAL_SD_Init(&s_camera_sd_handle);
        s_camera_sd_status.last_sd_init_status = (uint32_t)hal_status;
        s_camera_sd_status.last_sd_init_error =
            HAL_SD_GetError(&s_camera_sd_handle);
        if (hal_status != HAL_OK)
        {
            s_camera_sd_status.card_ready = 0U;
            s_camera_sd_status.sdio_ready = 0U;
            result = CAMERA_SD_ERR_SDIO_HAL_INIT_FAILED;
        }
        else
        {
            s_camera_sd_status.sdio_ready = 1U;
            hal_status = HAL_SD_GetCardInfo(
                &s_camera_sd_handle,
                &s_camera_sd_card_info);
            if (hal_status == HAL_OK)
            {
                result = Camera_SDStorage_WaitForCardTransfer();
                if (result == CAMERA_SD_OK)
                {
                    s_camera_sd_status.card_ready = 1U;
                    s_camera_sd_card_info_valid = 1U;
                }
                else
                {
                    s_camera_sd_status.card_ready = 0U;
                }
            }
            else
            {
                s_camera_sd_status.card_ready = 0U;
                result = CAMERA_SD_ERR_CARD_INFO_FAILED;
            }
        }
    }

    s_camera_sd_status.fatfs_ready = 0U;
    Camera_SDStorage_SetLastError(result);
    return result;
}

uint32_t Camera_SDStorage_RequestTakeoverExit(void)
{
    uint32_t result = CAMERA_SD_OK;
    uint32_t gpio_result;

    if ((s_camera_sd_hal_init_attempted != 0U) ||
        (s_camera_sd_clock_enabled != 0U))
    {
        if (HAL_SD_DeInit(&s_camera_sd_handle) != HAL_OK)
        {
            Camera_SDStorage_RecordFirstError(
                &result,
                CAMERA_SD_ERR_SDIO_HAL_DEINIT_FAILED);
        }
        s_camera_sd_hal_init_attempted = 0U;
    }

    Camera_SDStorage_DisableSdioClock();
    if ((RCC->APB2ENR & RCC_APB2ENR_SDIOEN) != 0U)
    {
        Camera_SDStorage_RecordFirstError(
            &result,
            CAMERA_SD_ERR_SDIO_CLOCK_DISABLE_FAILED);
    }
    s_camera_sd_status.card_ready = 0U;
    s_camera_sd_status.sdio_ready = 0U;
    s_camera_sd_status.fatfs_ready = 0U;
    s_camera_sd_card_info_valid = 0U;
    s_camera_sd_fatfs_session_active = 0U;
    s_camera_sd_fatfs_write_allowed = 0U;

    gpio_result = Camera_SDStorage_LeaveFullSdioGpioToInput();
    Camera_SDStorage_RecordFirstError(&result, gpio_result);

    gpio_result = Camera_SDStorage_RestoreConflictPins();
    Camera_SDStorage_RecordFirstError(&result, gpio_result);

    Camera_SDStorage_SetLastError(result);
    return result;
}

uint32_t Camera_SDStorage_FatFsDiskStatus(void)
{
    if ((s_camera_sd_fatfs_session_active == 0U) ||
        (s_camera_sd_status.sdio_ready == 0U) ||
        (s_camera_sd_card_info_valid == 0U))
    {
        return CAMERA_SD_ERR_FATFS_DISK_NOT_READY;
    }

    return (HAL_SD_GetCardState(&s_camera_sd_handle) ==
            HAL_SD_CARD_TRANSFER) ?
        CAMERA_SD_OK : CAMERA_SD_ERR_FATFS_DISK_NOT_READY;
}

uint32_t Camera_SDStorage_FatFsDiskInitialize(void)
{
    uint32_t result;

    if ((s_camera_sd_fatfs_session_active == 0U) ||
        (s_camera_sd_status.sdio_ready == 0U) ||
        (s_camera_sd_card_info_valid == 0U))
    {
        result = CAMERA_SD_ERR_FATFS_DISK_NOT_READY;
    }
    else
    {
        result = Camera_SDStorage_WaitForCardTransfer();
    }

    if (result != CAMERA_SD_OK)
    {
        s_camera_sd_fatfs_disk_error = result;
    }
    return result;
}

uint32_t Camera_SDStorage_FatFsDiskRead(
    uint8_t *buffer,
    uint32_t sector,
    uint32_t count)
{
    HAL_StatusTypeDef hal_status;
    uint32_t result;

    if ((buffer == NULL) || (count == 0U))
    {
        result = CAMERA_SD_ERR_INVALID_ARGUMENT;
    }
    else if ((s_camera_sd_fatfs_session_active == 0U) ||
             (s_camera_sd_status.sdio_ready == 0U) ||
             (s_camera_sd_card_info_valid == 0U))
    {
        result = CAMERA_SD_ERR_FATFS_DISK_NOT_READY;
    }
    else
    {
        result = Camera_SDStorage_WaitForCardTransfer();
        if (result == CAMERA_SD_OK)
        {
            hal_status = HAL_SD_ReadBlocks(
                &s_camera_sd_handle,
                buffer,
                sector,
                count,
                CAMERA_SD_FATFS_READ_TIMEOUT_MS);
            s_camera_sd_status.last_sd_rw_status = (uint32_t)hal_status;
            s_camera_sd_status.last_sd_rw_error =
                HAL_SD_GetError(&s_camera_sd_handle);
            if (hal_status != HAL_OK)
            {
                result = CAMERA_SD_ERR_FATFS_DISK_READ_FAILED;
            }
            else
            {
                result = Camera_SDStorage_WaitForCardTransfer();
            }
        }
    }

    if (result != CAMERA_SD_OK)
    {
        s_camera_sd_fatfs_disk_error = result;
    }
    return result;
}

uint32_t Camera_SDStorage_FatFsDiskWrite(
    const uint8_t *buffer,
    uint32_t sector,
    uint32_t count)
{
    HAL_StatusTypeDef hal_status;
    uint32_t result;

    if ((buffer == NULL) || (count == 0U))
    {
        result = CAMERA_SD_ERR_INVALID_ARGUMENT;
    }
    else if ((s_camera_sd_fatfs_session_active == 0U) ||
             (s_camera_sd_fatfs_write_allowed == 0U) ||
             (s_camera_sd_status.sdio_ready == 0U) ||
             (s_camera_sd_card_info_valid == 0U))
    {
        result = CAMERA_SD_ERR_FATFS_DISK_NOT_READY;
    }
    else
    {
        result = Camera_SDStorage_WaitForCardTransfer();
        if (result == CAMERA_SD_OK)
        {
            hal_status = HAL_SD_WriteBlocks(
                &s_camera_sd_handle,
                (uint8_t *)buffer,
                sector,
                count,
                CAMERA_SD_FATFS_WRITE_TIMEOUT_MS);
            s_camera_sd_status.last_sd_rw_status = (uint32_t)hal_status;
            s_camera_sd_status.last_sd_rw_error =
                HAL_SD_GetError(&s_camera_sd_handle);
            if (hal_status != HAL_OK)
            {
                result = CAMERA_SD_ERR_FATFS_DISK_WRITE_FAILED;
            }
            else
            {
                result = Camera_SDStorage_WaitForCardTransfer();
            }
        }
    }

    if (result != CAMERA_SD_OK)
    {
        s_camera_sd_fatfs_disk_error = result;
        Camera_SDStorage_SetSaveError(result);
        Camera_SDStorage_SetLastError(result);
    }
    return result;
}

