IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    if ((Camera_SnapshotControl_IsSoftwareGuardActive() != 0U) ||
        (s_camera_sd_fatfs_session_active != 0U) ||
        (s_camera_sd_full_gpio_af12_selected != 0U) ||
        (s_camera_sd_clock_enabled != 0U) ||
        (s_camera_sd_status.dvp_mask_active != 0U))
    {
        result = CAMERA_SD_ERR_SNAPSHOT_BUSY;
        s_camera_sd_status.last_snapshot_text = "FAIL";
        Camera_SDStorage_SetSaveError(result);
        Camera_SDStorage_SetLastError(result);
        result_info.error_code = result;
        result_info.error_text = Camera_SDStorage_ErrorToString(result);
        if (snapshot_result != NULL)
        {
            *snapshot_result = result_info;
        }
        return result;
    }

    s_camera_sd_status.dvp_reg_3018_saved =
        CAMERA_SD_REG_VALUE_UNKNOWN;
    restore_continuous_capture =
        ((DCMI->CR & DCMI_CR_CAPTURE) != 0U) ? 1U : 0U;
    Camera_SDStorage_EnsureDcmiDmaHandle();
    prepare_attempted = 1U;
    step_result = Camera_SnapshotControl_RequestPrepare();
    if (step_result != CAMERA_SNAPSHOT_OK)
    {
        result = CAMERA_SD_ERR_SNAPSHOT_PREPARE_FAILED;
        goto cleanup;
    }

    step_result = Camera_SDStorage_StopDvpConflictPads();
    if (s_camera_sd_status.dvp_reg_3018_saved !=
        CAMERA_SD_REG_VALUE_UNKNOWN)
    {
        dvp_restore_required = 1U;
    }
    if (step_result != CAMERA_SD_OK)
    {
        result = step_result;
        goto cleanup;
    }

    takeover_attempted = 1U;
    step_result = Camera_SDStorage_RequestTakeoverEnter();
    if (step_result != CAMERA_SD_OK)
    {
        result = step_result;
        goto cleanup;
    }

    step_result = Camera_SDStorage_RequestInit();
    if (step_result != CAMERA_SD_OK)
    {
        result = step_result;
        goto cleanup;
    }

    s_camera_sd_fatfs_session_active = 1U;
    mount_attempted = 1U;
    fatfs_result = f_mount(&s_camera_sd_fatfs, "", 1U);
    Camera_SDStorage_SetMountResult(fatfs_result);
    result_info.mount_text = s_camera_sd_status.last_mount_text;
    if (fatfs_result != FR_OK)
    {
        result = (s_camera_sd_fatfs_disk_error != CAMERA_SD_OK) ?
            s_camera_sd_fatfs_disk_error :
            CAMERA_SD_ERR_FATFS_MOUNT_FAILED;
        goto cleanup;
    }

    s_camera_sd_status.fatfs_ready = 1U;
    s_camera_sd_fatfs_write_allowed = 1U;
    fatfs_result = f_open(
        &s_camera_sd_file,
        CAMERA_SD_SNAPSHOT_FILE_NAME,
        FA_CREATE_ALWAYS | FA_WRITE);
    if (fatfs_result != FR_OK)
    {
        result = (s_camera_sd_fatfs_disk_error != CAMERA_SD_OK) ?
            s_camera_sd_fatfs_disk_error :
            CAMERA_SD_ERR_FATFS_FILE_OPEN_FAILED;
        goto cleanup;
    }
    file_opened = 1U;

    fatfs_result = f_write(
        &s_camera_sd_file,
        s_camera_sd_snapshot_text,
        (UINT)(sizeof(s_camera_sd_snapshot_text) - 1U),
        &bytes_written);
    if ((fatfs_result != FR_OK) ||
        (bytes_written != (UINT)(sizeof(s_camera_sd_snapshot_text) - 1U)))
    {
        result_info.write_text = "FAIL";
        result = (s_camera_sd_fatfs_disk_error != CAMERA_SD_OK) ?
            s_camera_sd_fatfs_disk_error :
            CAMERA_SD_ERR_FATFS_FILE_WRITE_FAILED;
        goto cleanup;
    }
    result_info.write_text = "PASS";

cleanup:
    if (file_opened != 0U)
    {
        fatfs_result = f_close(&s_camera_sd_file);
        file_opened = 0U;
        if (fatfs_result != FR_OK)
        {
            result_info.write_text = "FAIL";
            step_result = (s_camera_sd_fatfs_disk_error != CAMERA_SD_OK) ?
                s_camera_sd_fatfs_disk_error :
                CAMERA_SD_ERR_FATFS_FILE_CLOSE_FAILED;
            Camera_SDStorage_RecordFirstError(&cleanup_result, step_result);
            Camera_SDStorage_RecordFirstError(&result, step_result);
        }
    }
    s_camera_sd_fatfs_write_allowed = 0U;

    if (mount_attempted != 0U)
    {
        fatfs_result = f_mount(NULL, "", 0U);
        if (fatfs_result != FR_OK)
        {
            step_result = CAMERA_SD_ERR_FATFS_UNMOUNT_FAILED;
            Camera_SDStorage_RecordFirstError(&cleanup_result, step_result);
            Camera_SDStorage_RecordFirstError(&result, step_result);
        }
        s_camera_sd_status.fatfs_ready = 0U;
    }
    s_camera_sd_fatfs_session_active = 0U;

    if (takeover_attempted != 0U)
    {
        step_result = Camera_SDStorage_RequestTakeoverExit();
        Camera_SDStorage_RecordFirstError(&restore_result, step_result);
        Camera_SDStorage_RecordFirstError(&cleanup_result, step_result);
        Camera_SDStorage_RecordFirstError(&result, step_result);
    }

    if (dvp_restore_required != 0U)
    {
        step_result = Camera_SDStorage_RestoreDvpConflictPads();
        Camera_SDStorage_RecordFirstError(&restore_result, step_result);
        Camera_SDStorage_RecordFirstError(&cleanup_result, step_result);
        Camera_SDStorage_RecordFirstError(&result, step_result);
    }

    if (prepare_attempted != 0U)
    {
        step_result = Camera_SDStorage_RestoreCameraLink(
            restore_continuous_capture,
            takeover_attempted);
        Camera_SDStorage_RecordFirstError(&restore_result, step_result);
        Camera_SDStorage_RecordFirstError(&cleanup_result, step_result);
        Camera_SDStorage_RecordFirstError(&result, step_result);
    }

    result_info.restore_text =
        (restore_result == CAMERA_SD_OK) ? "PASS" : "FAIL";
    result_info.cleanup_text =
        (cleanup_result == CAMERA_SD_OK) ? "PASS" : "FAIL";
    if (result == CAMERA_SD_OK)
    {
        s_camera_sd_status.last_snapshot_text = "PASS";
        s_camera_sd_status.last_file_size = (uint32_t)bytes_written;
        ++s_camera_sd_status.save_count;
    }
    else
    {
        s_camera_sd_status.last_snapshot_text = "FAIL";
        s_camera_sd_status.last_file_size = 0U;
    }

    s_camera_sd_status.card_ready =
        (result == CAMERA_SD_OK) ? 1U : 0U;
    Camera_SDStorage_SetSaveError(result);
    Camera_SDStorage_SetLastError(result);
    result_info.bytes_written = s_camera_sd_status.last_file_size;
    result_info.error_code = result;
    result_info.error_text = Camera_SDStorage_ErrorToString(result);
    if (snapshot_result != NULL)
    {
        *snapshot_result = result_info;
    }
    return result;
}

const char *Camera_SDStorage_ErrorToString(uint32_t error_code)
{
    switch (error_code)
    {
        case CAMERA_SD_OK:
            return "OK";
        case CAMERA_SD_ERR_NOT_IMPLEMENTED:
            return "NOT_IMPLEMENTED";
        case CAMERA_SD_ERR_NEED_TAKEOVER:
            return "NEED_TAKEOVER";
        case CAMERA_SD_ERR_TAKEOVER_ALREADY_ACTIVE:
            return "TAKEOVER_ALREADY_ACTIVE";
        case CAMERA_SD_ERR_SNAPSHOT_NOT_PAUSED:
            return "SNAPSHOT_NOT_PAUSED";
        case CAMERA_SD_ERR_CONFLICT_PIN_RELEASE_FAILED:
            return "CONFLICT_PIN_RELEASE_FAILED";
        case CAMERA_SD_ERR_CONFLICT_PIN_RESTORE_FAILED:
            return "CONFLICT_PIN_RESTORE_FAILED";
        case CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED:
            return "SDIO_AF12_SWITCH_FAILED";
        case CAMERA_SD_ERR_SDIO_AF12_RESTORE_FAILED:
            return "SDIO_AF12_RESTORE_FAILED";
        case CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED:
            return "SDIO_FULL_GPIO_SWITCH_FAILED";
        case CAMERA_SD_ERR_SDIO_FULL_GPIO_RESTORE_FAILED:
            return "SDIO_FULL_GPIO_RESTORE_FAILED";
        case CAMERA_SD_ERR_SDIO_HAL_INIT_FAILED:
            return "SDIO_HAL_INIT_FAILED";
        case CAMERA_SD_ERR_SDIO_HAL_DEINIT_FAILED:
            return "SDIO_HAL_DEINIT_FAILED";
        case CAMERA_SD_ERR_CARD_INFO_FAILED:
            return "CARD_INFO_FAILED";
        case CAMERA_SD_ERR_SENSOR_REG_READ_FAILED:
            return "SENSOR_REG_READ_FAILED";
        case CAMERA_SD_ERR_SENSOR_REG_WRITE_FAILED:
            return "SENSOR_REG_WRITE_FAILED";
        case CAMERA_SD_ERR_SENSOR_REG_VERIFY_FAILED:
            return "SENSOR_REG_VERIFY_FAILED";
        case CAMERA_SD_ERR_NO_SAVED_3018:
            return "NO_SAVED_3018";
        case CAMERA_SD_ERR_SNAPSHOT_BUSY:
            return "SNAPSHOT_BUSY";
        case CAMERA_SD_ERR_SNAPSHOT_PREPARE_FAILED:
            return "SNAPSHOT_PREPARE_FAILED";
        case CAMERA_SD_ERR_FATFS_MOUNT_FAILED:
            return "FATFS_MOUNT_FAILED";
        case CAMERA_SD_ERR_FATFS_UNMOUNT_FAILED:
            return "FATFS_UNMOUNT_FAILED";
        case CAMERA_SD_ERR_FATFS_DISK_NOT_READY:
            return "FATFS_DISK_NOT_READY";
        case CAMERA_SD_ERR_FATFS_DISK_READ_FAILED:
            return "FATFS_DISK_READ_FAILED";
        case CAMERA_SD_ERR_FATFS_DISK_IOCTL_FAILED:
            return "FATFS_DISK_IOCTL_FAILED";
        case CAMERA_SD_ERR_FATFS_CARD_TIMEOUT:
            return "FATFS_CARD_TIMEOUT";
        case CAMERA_SD_ERR_INVALID_ARGUMENT:
            return "INVALID_ARGUMENT";
        case CAMERA_SD_ERR_FATFS_DISK_WRITE_FAILED:
            return "FATFS_DISK_WRITE_FAILED";
        case CAMERA_SD_ERR_FATFS_FILE_OPEN_FAILED:
            return "FATFS_FILE_OPEN_FAILED";
        case CAMERA_SD_ERR_FATFS_FILE_WRITE_FAILED:
            return "FATFS_FILE_WRITE_FAILED";
        case CAMERA_SD_ERR_FATFS_FILE_CLOSE_FAILED:
            return "FATFS_FILE_CLOSE_FAILED";
        case CAMERA_SD_ERR_SDIO_CLOCK_DISABLE_FAILED:
            return "SDIO_CLOCK_DISABLE_FAILED";
        case CAMERA_SD_ERR_CAMERA_RESTORE_FAILED:
            return "CAMERA_RESTORE_FAILED";
        default:
            return "UNKNOWN_ERROR";
    }
}
